cask_args appdir: "/Applications"

# CLI Applications
cask "docker-desktop"
brew "git"
brew "asdf"
brew "gawk"
brew "gpg"
brew "jq"
brew "tree"
brew "xz"
brew "osmium-tool"
brew "tippecanoe"
brew "java"

# GUI Applications
cask "visual-studio-code"
cask "google-chrome"
cask "firefox"
cask "microsoft-edge"

# App Store Applications
mas "Xcode", id: 497799835
mas "TestFlight", id: 899247664
mas "RunCat", id: 1429033973
mas "Windows App", id: 1295203466